{"intents": [
    {"tag": "salam",
     "patterns": ["Hai", "Hi", "Halo", "Apa Kabar", "Selamat Pagi", "Selamat Siang", "Selamat Malam", "Salam", "Ping", "P"],
     "responses": ["Halo!", "Hai", "Halo, ada yang bisa saya bantu?", "Halo selamat datang", "Hai Kawan"]
    },
    {"tag": "bye",
     "patterns": ["Dadah", "Selamat Tinggal", "Dah", "Daah", "Semoga harimu menyenangkan", "Ok makasih", "Sampai Jumpa Lagi", "Ok bye", "Oke makasi"],
     "responses": ["Sampai jumpa lagi yaa", "Kalau ada masalah, hubungi aku lagi ya", "Semoga harimu menyenangkan!"]
    },
    {"tag": "nama",
     "patterns": ["nama kamu siapa?", "lu siapa?", "siapa sih lo?", "lu sape ?", "nama lo sape dah ?", "nama?"],
     "responses": ["Namaku Pira (PindaiRasa), salam kenal kak!", "Halo, aku Pira (PindaiRasa)!", "Kenalin, aku Pira (PindaiRasa)!"]
    },
    {"tag": "pekerjaan",
     "patterns": ["lu ngapain?", "pekerjaan kamu apa?", "lu kerja apa?", "tugas kamu apa?", "tugas lo ngapain?"],
     "responses": ["Aku ngebantu kamu dalam ngerekomendasiin makanan yang kamu pengen", "Tugasku jadi asisten di Aplikasi PindaiRasa"]
    },
    {"tag": "pindairasa",
    "patterns": ["emang pindairasa apa si?", "apa tuh pindairasa?", "emang pindai rasa apa sih?", "wah apa tuh pindai rasa?", "pindairasa emang apa?"],
    "responses": ["PindaiRasa adalah sebuah Aplikasi yang berfungsi untuk memberikan rekomendasi makanan untuk pengguna yang tidak mengetahui resep makanan yang ia pengen kak "]
    },
    {"tag": "pindairasa_typo",
    "patterns": ["emang pindahrasa apa ?", "apaan si pindairas?", "emang pindau rasa apa sih?","emang pindaorasa apa sih?", "wah apa tuh pindak rasa?", "pindarasa emang apa?"],
    "responses": ["PindaiRasa kaak, jangan bikin emosi deh", "Typo kak, PindaiRasa kali maksudnya"]
    },
    {"tag": "rekomendasi",
     "patterns": ["Beri aku rekomendasi makanan dong", "apa aja rekomendasi makanannya?", "apa rekomendasi makanannya?", "makanannya apa aja?", "rekom makanan dong"],
     "responses": ["Banyak kak, agar lebih menarik kakak bisa menggunakan fitur terbaru yaitu pengenalan bahan makanan melalui kamera/foto kak!", "Makanannya mulai dari makanan berat dari Indonesia sampai ke makanan ringan juga kak, semoga tertarik kak!"]
    },
    {"tag": "tutorial",
     "patterns": ["kalau mau nyobain fitur terbaru bagaimana ya?", "ada cara buat make fitur terbaru?", "fitur terbaru caranya gimana?", "tutor pakai cara terbaru dong!", "bisa buatin tutorial memakai fitur terbaru?", "bisa bantu menggunakan fitur terbarunya?", "bisa bantuin gunain fitur terbaru?"],
     "responses": ["Bisa banget kak, caranya kakak bisa menuju ke ikon gambar kamera dibawah, lalu kakak bisa memilih mengenali bahan makanan dengan menggunakan kamera hp atau dari folder penyimpanan kakak!", "Bisa dong kak,kakak bisa menggunakan ikon gambar kamera yang ada dibawah dan nanti ada 2 pilihan yaitu menggunakan kamera atau gambar dari folder penyimpanan kak!", "Baik kak, jadi caranya bisa menekan ikon gambar kamera yang ada dibawah, lalu terdapat 2 pilihan yaitu menggunakan kamera atau gambar dari folder penyimpanan saja kak :)"]
    },
    {"tag": "kemampuan",
     "patterns": ["kamu bisa apa?", "apa yang bisa anda lakukan?", "kamu bisa ngapain aja?", "lo bisa ngapain?", "apa kemampuan lo?", "emang lu bisa ngapain aja?"],
     "responses": ["Kakak bisa tanya-tanya nama aku, apa yang aku lakukan dan yang berhubungan dengan rekomendasi resep makanan", "Pokoknya yang berhubungan sama rekomendasi resep makanan kak :)"]
    },
    {"tag": "minuman_dingin",
     "patterns": ["Aku lagi pengen yang dingin-dingin nih", "duh, kok hari ini panas banget ya", "minuman yang dingin apa ya?", "pengen yang seger seger gitu", "biar seger, minum apa ya enaknya?", "Saya ingin minuman yang segar.", "Ada saran untuk minuman menyegarkan?", "Bisakah Anda merekomendasikan minuman dingin?", "Apa minuman terbaik untuk cuaca panas?", "Bagaimana dengan minuman yang menyegarkan?", "Sarankan minuman dingin yang enak, dong.", "Minuman apa yang cocok untuk hari yang panas ini?", "Apa pilihan minuman dingin hari ini?", "Saya butuh minuman yang menyegarkan sekarang.", "Ada minuman favorit yang dingin?"],
     "responses": ["Coba buat es teh lemon atau es jeruk alami di rumah. Keduanya menyegarkan!", "Mungkin Anda suka mencoba membuat es kelapa muda atau es teh tarik sendiri. Keduanya nikmat!", "Saran saya, buat es jeruk, es teh tawar, atau es teh susu di rumah. Semua sangat lezat!", "Bagaimana kalau mencoba membuat es kopi susu atau es kopi matcha di dapur sendiri?", "Anda bisa membuat es teh tarik atau es teh susu tarik homemade. Praktis dan enak!", "Saya merekomendasikan resep es kopi matcha atau es kopi vanilla yang bisa Anda coba buat sendiri.", "Minuman dingin yang paling dicari saat ini adalah es buah segar atau es buah melon buatan sendiri.", "Anda mungkin menyukai resep es teler atau es kelapa muda buatan sendiri. Sangat menyegarkan!", "Saran saya, coba buat es cendol atau es dawet di rumah. Pasti seru dan lezat!", "Apa pendapat Anda tentang membuat es kopi vanilla atau es kopi caramel sendiri? Kedua-duanya spesial!"]
    },
    {"tag": "minuman_hangat",
     "patterns": ["Saya ingin minuman yang hangat.", "Ada saran untuk minuman yang menyenangkan di cuaca dingin?", "Bagaimana dengan secangkir kopi atau teh panas?", "Saran minuman panas untuk hari yang dingin, dong.", "Bisakah Anda merekomendasikan minuman hangat yang enak?", "Bagaimana kalau secangkir teh herbal yang menyenangkan?", "Minuman apa yang cocok untuk cuaca dingin seperti ini?", "Apa pilihan minuman hangat hari ini?", "Ada minuman favorit yang cocok untuk cuaca sejuk?", "Saya butuh minuman yang menghangatkan sekarang."],
     "responses": ["Bagaimana dengan secangkir teh herbal seperti chamomile, peppermint, atau lavender? Semuanya sangat cocok untuk hari yang dingin.", "Mungkin Anda akan menyukai minuman cokelat panas, teh hijau hangat, atau kopi hitam yang harum. Pilihlah yang sesuai dengan selera Anda!", "Saran saya, nikmati secangkir cappuccino, teh earl grey, atau white hot chocolate. Semuanya memberikan kenikmatan di cuaca dingin.", "Anda mungkin ingin mencoba minuman matcha latte panas, teh jahe hangat, atau kopi espresso yang menyegarkan.", "Bagaimana kalau menikmati teh oolong hangat, cokelat panas dengan marshmallow, atau mocha latte yang lezat?", "Saya merekomendasikan resep teh tarik panas, cappuccino caramel, atau kopi latte yang bisa Anda buat di rumah.", "Minuman hangat yang paling dicari saat ini adalah chai latte, hot apple cider, atau hot chocolate dengan whipped cream.", "Anda mungkin menyukai minuman vanilla latte panas, teh matcha latte, atau cappuccino tradisional.", "Saran saya, buat hot toddy, chai tea latte, atau hot caramel macchiato di rumah. Pasti akan membuat Anda hangat!", "Apa pendapat Anda tentang membuat kopi mocha panas, teh tarik jahe, atau green tea latte? Semuanya cocok untuk cuaca sejuk."]
    },
    {"tag": "camilan",
     "patterns": ["Pengen ngemil nih","Saya ingin camilan yang enak.", "Ada saran untuk makanan ringan yang ringan di perut?", "Bagaimana dengan beberapa ide camilan yang lezat?", "Saran camilan untuk menemani waktu santai, dong.", "Bisakah Anda merekomendasikan camilan yang enak?", "Ada camilan favorit yang bisa saya coba?", "Bagaimana kalau beberapa ide camilan yang sehat dan lezat?", "Apa pilihan camilan ringan hari ini?", "Ada camilan yang cocok untuk cuaca sejuk?", "Saya butuh camilan yang gurih sekarang."],
     "responses": ["Bagaimana dengan beberapa pilihan camilan sehat seperti potongan buah segar, kacang-kacangan panggang, atau yogurt dengan granola?", "Mungkin Anda akan menyukai camilan gurih seperti kacang mete, popcorn berbumbu, atau crackers dengan keju.", "Saran saya, nikmati beberapa potong wortel dengan hummus, irisan apel dengan selai kacang, atau smoothie bowl yang menyegarkan.", "Anda mungkin ingin mencoba camilan berbasis roti seperti bruschetta, crostini dengan daging asap, atau roti panggang dengan alpukat.", "Bagaimana kalau menikmati camilan manis seperti kue kering, pisang goreng, atau churros dengan cokelat leleh?", "Saya merekomendasikan beberapa pilihan camilan sehat seperti edamame panggang, selada buah dengan keju cottage, atau smoothie protein.", "Camilan ringan yang paling dicari saat ini adalah acai bowl, bar granola, atau trail mix yang dapat disesuaikan.", "Anda mungkin menyukai camilan tradisional seperti pastel mini, risoles, atau lemper. Semuanya enak!", "Saran saya, buat camilan sehat di rumah seperti telur rebus dengan garam merica, trail mix buatan sendiri, atau salad buah segar.", "Apa pendapat Anda tentang membuat camilan gurih seperti popcorn karamel, batang sereal, atau biskuit dengan keju? Semua pilihan yang lezat!"]
    },
    {"tag": "makanan_berat",
     "patterns": ["Saya ingin makanan yang mengenyangkan.", "Ada saran untuk hidangan utama yang lezat dan bergizi?", "Bagaimana dengan beberapa ide makan malam yang menggugah selera?", "Saran hidangan utama untuk makanan berat, dong.", "Bisakah Anda merekomendasikan hidangan berat yang enak?", "Ada hidangan favorit yang bisa saya coba?", "Bagaimana kalau beberapa ide hidangan yang mengenyangkan?", "Apa pilihan hidangan utama hari ini?", "Ada hidangan yang cocok untuk cuaca sejuk?", "Saya butuh hidangan yang substansial sekarang."],
     "responses": ["Bagaimana dengan beberapa pilihan nasi goreng, rendang, atau sate ayam? Semuanya adalah hidangan berat Indonesia yang lezat!", "Mungkin Anda akan menyukai hidangan gulai kambing, bakso, atau mie goreng spesial.", "Saran saya, nikmati beberapa pilihan nasi padang, bubur ayam, atau rawon yang kaya akan rasa.", "Anda mungkin ingin mencoba hidangan gado-gado, soto ayam, atau tongseng sapi. Semuanya menggugah selera!", "Bagaimana kalau menikmati hidangan rendang padang, nasi uduk, atau nasi kuning dengan lauk-pauknya?", "Saya merekomendasikan beberapa pilihan sate padang, nasi liwet, atau bebek goreng yang bisa membuat hidangan berat Anda lebih spesial.", "Hidangan berat yang paling dicari saat ini adalah nasi pecel, nasi goreng Jawa, atau pecel lele.", "Anda mungkin menyukai hidangan nasi campur Bali, soto Betawi, atau nasi bakar. Semuanya sangat mengenyangkan!", "Saran saya, buat hidangan rendang daging, nasi goreng kambing, atau sop buntut di rumah. Pasti akan memanjakan lidah Anda!", "Apa pendapat Anda tentang membuat hidangan lontong sayur, nasi goreng Jawa, atau sate lilit Bali? Semuanya pilihan hidangan berat yang lezat!"]
    }
]
}